<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>git2</title>
        
    <link rel="stylesheet" type="text/css" href="../../static/css/main.css">
</head>
<body>
<div class="navbar navbar-line">
    <div class="container">
        <div class="logo">
            
                git2
            
        </div>
        <input type="checkbox" id="idoc_nav" />
        <div class="menu_tree">
        <ul><li><a href="../../index.html">index</a></li><li><a href="#"><span></span>Node.js</a><ul><li><a href="../../html/Node.js/node入门(2).html">node入门(2)</a></li><li><a href="../../html/Node.js/node 1.html">node 1</a></li></ul></li><li><a href="#"><span></span>contact</a><ul></ul></li><li><a href="#"><span></span>Angular</a><ul><li><a href="../../html/Angular/AngularJS 2.html">AngularJS 2</a></li><li><a href="../../html/Angular/AngularJS.html">AngularJS</a></li></ul></li><li><a href="#"><span></span>React</a><ul></ul></li><li><a href="#"><span></span>前端工程</a><ul><li><a href="../../html/前端工程/Gulp.html">Gulp</a></li></ul></li><li><a href="#"><span></span>原生JavaScript</a><ul></ul></li><li><a href="#"><span></span>设计、算法和思考</a><ul><li><a href="../../html/设计、算法和思考/订阅发布模式详解.html">订阅发布模式详解</a></li></ul></li><li><a href="#"><span></span>temp</a><ul><li><a href="../../html/temp/AJAX.html">AJAX</a></li><li><a href="../../html/temp/DOM.html">DOM</a></li><li><a href="../../html/temp/ES6.html">ES6</a></li><li><a href="../../html/temp/HTTP.html">HTTP</a></li><li><a href="../../html/temp/JS 基础知识拾遗.html">JS 基础知识拾遗</a></li><li class="active"><a href="../../html/temp/事件.html">事件</a></li><li><a href="../../html/temp/函数.html">函数</a></li></ul></li></ul>
        </div>
        
        <!---->

        <section class="idoc_nav_btn">
            <label for="idoc_nav"><span></span></label>
        </section>
    </div>
    
</div>




<div class="container">
    
        <div class="page-toc">
            <ul><li><a href="#t0事件">事件</a></li></ul>
        </div>

        <div class="content markdown-body">

            <h1 id="t0&#x4E8B;&#x4EF6;">&#x4E8B;&#x4EF6; <a href="#t0&#x4E8B;&#x4EF6;"> # </a></h1>
<p>&#x6807;&#x7B7E;&#xFF1A; javascript event DOM0&#x7EA7;&#x4E8B;&#x4EF6; DOM2&#x7EA7;&#x4E8B;&#x4EF6; IE&#x517C;&#x5BB9;&#x5904;&#x7406; &#x4E8B;&#x4EF6;&#x5192;&#x6CE1;</p>
<blockquote>
<p>&#x4E8B;&#x4EF6;&#x6307;&#x7684;&#x662F;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x5185;&#x5916;&#x53D1;&#x751F;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x884C;&#x4E3A;&#x3002;
    &#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x5143;&#x7D20;&#x6765;&#x8BF4;&#x4E0D;&#x7BA1;&#x662F;&#x5426;&#x7ED9;&#x5176;&#x7ED1;&#x5B9A;&#x65B9;&#x6CD5;&#xFF0C;&#x53EA;&#x8981;&#x5F53;&#x524D;&#x884C;&#x4E3A;&#x89E6;&#x53D1;&#xFF0C;&#x90A3;&#x4E48;&#x4E8B;&#x4EF6;&#x5C31;&#x4F1A;&#x89E6;&#x53D1;&#x6D4F;&#x89C8;&#x5668;&#x611F;&#x77E5;&#xFF1B;</p>
</blockquote>
<hr>
<p>##&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#xFF08;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#xFF09;
&#x7ED9;&#x5143;&#x7D20;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x5F53;&#x4E8B;&#x4EF6;<strong>&#x89E6;&#x53D1;</strong>&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x628A;<strong>&#x7ED1;&#x5B9A;</strong>&#x7684;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x3002;</p>
<p>##&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;</p>
<ol>
<li>&#x6765;&#x6E90;
&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x76F8;&#x5173;&#x7ED1;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x4F1A;&#x88AB;&#x4F9D;&#x6B21;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x6267;&#x884C;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x8FD8;&#x4F1A;&#x9ED8;&#x8BA4;&#x7ED9;&#x6BCF;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x4F20;&#x9012;&#x4E00;&#x4E2A;<strong>&#x53C2;&#x6570;&#x503C;</strong>--&gt;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x3002;
&#x4E8B;&#x4EF6;&#x6E90;<code>e.target</code>&#xFF1A;&#x5B58;&#x50A8;&#x5728;&#x65F6;&#x95F4;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x7528;&#x6765;&#x6807;&#x8BC6;&#x4E8B;&#x4EF6;&#x662F;&#x7531;&#x54EA;&#x4E2A;&#x5143;&#x7D20;&#x53D1;&#x751F;&#x7684;</li>
<li>&#x5206;&#x7C7B;&#xFF1A;<ul>
<li>&#x9F20;&#x6807;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;MouseEvent\<blockquote>
<p>&#x5B83;&#x662F;MouseEevnt&#x7C7B;&#x7684;&#x4E00;&#x4E2A;<strong>&#x5B9E;&#x4F8B;</strong>&#x3002;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x5F53;&#x524D;&#x9F20;&#x6807;&#x672C;&#x6B21;&#x64CD;&#x4F5C;<strong>&#x76F8;&#x5173;&#x4FE1;&#x606F;</strong>&#x7684;&#x3002;
&#x5E38;&#x7528;&#x7684;&#x5C5E;&#x6027;&#x6709;&#xFF1A;
<code>e.clientX e.clientY</code>,&#x9F20;&#x6807;&#x8DDD;&#x79BB; &apos;&#x5F53;&#x524D;&#x5C4F;&#x5E55;&#x7A97;&#x53E3; &apos; &#x5DE6;&#x7AEF;&#x3001;&#x4E0A;&#x7AEF;&#x7684;&#x8DDD;&#x79BB;&#x3002;</p>
<pre><code>  `e.type`:&#x5B58;&#x50A8;&#x7684;&#x662F;&#x5F53;&#x524D;&#x64CD;&#x4F5C;&#x7684;&#x4E8B;&#x4EF6;&#x7C7B;&#x578B;&#xFF0C;--&gt;click&#xFF1B;
</code></pre><p>  &#x4EE5;&#x4E0B;&#x90FD;&#x6709;&#x517C;&#x5BB9;&#x95EE;&#x9898;&#xFF1A;</p>
<pre><code>   `e.pageX,e.pageY`,&#x5F53;&#x524D;&#x9F20;&#x6807;&#x64CD;&#x4F5C;&#x8FD9;&#x4E00;&#x70B9;&#x7684;&#x8DDD;&#x79BB;&#x2018;body&#x5DE6;&#x4E0A;&#x89D2;&#xFF08;&#x7B2C;&#x4E00;&#x5C4F;&#x5DE6;&#x4E0A;&#x89D2;&#xFF09;&#x2019;&#x7684;X/Y&#x8F74;&#x8DDD;&#x79BB;&#x3002;
</code></pre></blockquote>
</li>
</ul>
</li>
</ol>
<pre><code>- &#x952E;&#x76D8;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;KeyboardEvent
&gt;&#x5B83;&#x662F;KeyboardEvent&#x7C7B;&#x7684;&#x4E00;&#x4E2A;**&#x5B9E;&#x4F8B;**&#x3002;
&#x6700;&#x5E38;&#x7528;&#x7684;&#x5C5E;&#x6027;&#x662F;`ev.keycode`---&gt;&#x5B58;&#x50A8;&#x7684;&#x662F;&#x6309;&#x4E0B;&#x952E;&#x7684;&#x7F16;&#x7801;&#x503C;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x952E;&#x76D8;&#x4E0A;&#x7684;&#x952E;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x56FA;&#x5B9A;&#x7F16;&#x7801;&#x503C;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x5E38;&#x7528;&#x7684;keycode&#x503C;
</code></pre><p><code>Ctrl&#xFF1A;17</code>  <code>Alt:18</code>  <code>Space:32</code>   <code>enter:13</code> <code>backspace:8</code> <code>del:46</code>  <code>shift:16</code> <code>Alt+tab:9``f11:122,&#x5168;&#x5C4F;</code> <code>&#x5DE6;&#x4E0A;&#x53F3;&#x4E0B;37,38,39,40</code></p>
<ul>
<li><p>&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x7684;&#x517C;&#x5BB9;&#x95EE;&#x9898;&#x5904;&#x7406;&#xFF1A;</p>
<blockquote>
<p>&#x6807;&#x51C6;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;--&gt;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x662F;&#x4F5C;&#x4E3A;&#x5F62;&#x53C2;&#x81EA;&#x52A8;&#x4F20;&#x7ED9;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x51FD;&#x6570;&#x7684;&#x3002;</p>
<pre><code>     ie&#x6D4F;&#x89C8;&#x5668;&#x4E2D;--&gt;&#x4E8B;&#x4EF6;&#x5BF9;&#x8C61;&#x4FDD;&#x5B58;&#x5728;window.event&#xFF1B;
</code></pre><pre><code class="lang-javascript"><span class="hljs-keyword">if</span> (!ev) {<span class="hljs-comment">//-&gt;&#x8BF4;&#x660E;&#x6CA1;&#x6709;&#x4F20;&#x9012;ev&#x7684;&#x503C;,&#x5F53;&#x524D;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x662F;IE6~8,&#x6211;&#x4EEC;&#x628A;&#x4E00;&#x4E9B;&#x4E0D;&#x517C;&#x5BB9;&#x7684;&#x5C5E;&#x6027;&#x90FD;&#x6309;&#x7167;&#x6807;&#x51C6;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#x4E00;&#x904D;</span>
 ev = <span class="hljs-built_in">window</span>.event;
 ev.target = ev.srcElement;
 ev.pageX = ev.clientX + (<span class="hljs-built_in">document</span>.documentElement.scrollLeft || <span class="hljs-built_in">document</span>.body.scrollLeft);
 ev.pageY = ev.clientY + (<span class="hljs-built_in">document</span>.documentElement.scrollTop || <span class="hljs-built_in">document</span>.body.scrollTop);
 ev.preventDefault = <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
     ev.returnValue = <span class="hljs-literal">false</span>;<span class="hljs-comment">//&#x5904;&#x7406;&#x4E8B;&#x4EF6;&#x7684;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#xFF0C;&#x6BD4;&#x5982;&#x62D6;&#x62FD;&#x65F6;&#x9632;&#x6B62;&#x6D4F;&#x89C8;&#x5668;&#x8BEF;&#x4EE5;&#x4E3A;&#x8981;&#x9009;&#x4E2D;&#x6587;&#x5B57;&#x3002;</span>
 };
 ev.stopPropagation = <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params"></span>) </span>{
     ev.cancelBubble = <span class="hljs-literal">true</span>;<span class="hljs-comment">//&#x5904;&#x7406;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;</span>
 };
}
</code></pre>
<p>&#x53E6;&#xFF1A;</p>
<pre><code class="lang-&#x963B;&#x6B62;A&#x6807;&#x7B7E;&#x7684;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;">1&#xFF09;&#xFF0C;<a href="javascript:;">123</a>&#xFF1B;<a href="javascript:false/true/null/undefined;">123</a>&#xFF1B;&#xFF1F;
2&#xFF09;&#xFF0C;<a href="javascript:void 0;">123</a>;  
3&#xFF09;&#xFF0C;a&#x6807;&#x7B7E;&#x70B9;&#x51FB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5148;&#x628A;click&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x4F1A;&#x6267;&#x884C;&#x81EA;&#x5DF1;&#x7684;&#x9ED8;&#x8BA4;&#x8DF3;&#x8F6C;&#xFF08;herf&#xFF09;&#xFF0C;&#x6B64;&#x65F6;&#x53EF;&#x4EE5;return false&#x6765;&#x963B;&#x6B62;&#x6216;&#x8005;e.preventDefault,&#x6CE8;&#x610F;&#x517C;&#x5BB9;(ie-&gt;returnValue = false;)&#x3002;
</code></pre>
<p>##DOM 0&#x7EA7;&#x4E8B;&#x4EF6;
&#x7ED9;&#x5143;&#x7D20;&#x5BF9;&#x8C61;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x79C1;&#x6709;&#x5C5E;&#x6027;&#x8D4B;&#x4E00;&#x4E2A;&#x503C;&#xFF08;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x503C;&#xFF09;&#xFF1B;&#x5F53;&#x5143;&#x7D20;&#x7684;&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x5C5E;&#x6027;&#x503C;(&#x53EF;&#x4EE5;&#x662F;&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x8BA9;&#x5176;&#x6267;&#x884C;&#x3002;</p>
</blockquote>
<p>0&#x7EA7;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x53EA;&#x80FD;&#x7ED9;&#x5143;&#x7D20;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x4E00;&#x6B21;&#x65B9;&#x6CD5;&#xFF0C;&#x7ED1;&#x5B9A;&#x591A;&#x6B21;&#xFF0C;&#x6700;&#x540E;&#x7ED1;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x4F1A;&#x5427;&#x524D;&#x9762;&#x6240;&#x6709;&#x7ED1;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x8986;&#x76D6;&#x3002;</p>
</li>
</ul>
<pre><code class="lang-javascript"><span class="hljs-built_in">window</span>.onload=<span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{}   <span class="hljs-comment">//&#x5F53;&#x524D;&#x9875;&#x9762;&#x7684;HTML&#x7ED3;&#x6784;&#x3001;&#x56FE;&#x7247;&#x3001;&#x6587;&#x5B57;&#x7B49;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x90FD;&#x52A0;&#x8F7D;&#x5B8C;&#x6210;&#xFF0C;&#x624D;&#x4F1A;&#x89E6;&#x53D1;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x9875;&#x9762;&#x4E2D;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x4E00;&#x6B21;&#x3002;</span>
    <span class="hljs-comment">//&#x539F;&#x7406;&#xFF1A;&#x56E0;&#x4E3A;&#x5B83;&#x91C7;&#x7528;DOM 0&#x7EA7;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#xFF0C;&#x53EA;&#x6709;&#x7ED1;&#x5B9A;&#x4E00;&#x6B21;&#xFF0C;&#x540E;&#x9762;&#x7ED1;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x4F1A;&#x5427;&#x524D;&#x9762;&#x7684;&#x8986;&#x76D6;&#x6389;&#xFF1B;load&#x4E8B;&#x4EF6;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x8D44;&#x6E90;&#x52A0;&#x8F7D;&#x5B8C;&#x6210;&#x89E6;&#x53D1;&#x3002;</span>
    &#x6240;&#x4EE5;&lt;script&gt;&#x6807;&#x7B7E;&#x5982;&#x679C;&#x653E;&#x5728;body&#x4E4B;&#x524D;&#xFF0C;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;<span class="hljs-built_in">window</span>.onload&#x3002;
</code></pre>
<p>##DOM 2&#x7EA7;&#x4E8B;&#x4EF6;</p>
<blockquote>
<p> DOM 2&#x7EA7;&#x4E8B;&#x4EF6;&#x53EF;&#x4EE5;&#x7ED9;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x884C;&#x4E3A;&#x7ED1;&#x5B9A;<strong>&#x591A;&#x4E2A;&#x4E0D;&#x540C;</strong>&#x7684;&#x65B9;&#x6CD5;.
&#x539F;&#x7406;&#xFF1A;&#x9ED8;&#x8BA4;&#x7684;&#x4F1A;&#x7ED9;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x2018;&#x5185;&#x7F6E;&#x4E8B;&#x4EF6;&#x6C60;&#x2019;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;DOM2&#x7ED9;&#x5143;&#x7D20;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x7684;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#x90FD;&#x4F1A;&#x4F9D;&#x6B21;&#x7684;&#x5B58;&#x50A8;&#x5230;&#x8FD9;&#x4E2A;&#x5BB9;&#x5668;&#x4E2D;&#xFF0C;&#x5F53;&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x9ED8;&#x8BA4;&#x627E;&#x5230;&#x4E8B;&#x4EF6;&#x6C60;&#xFF0C;&#x4F1A;&#x5427;&#x5BB9;&#x5668;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#x4F9D;&#x6B21;&#x7684;&#x6267;&#x884C;&#x3002; </p>
</blockquote>
<p><code>addEventListener</code> &#x5B9E;&#x73B0;&#x7ED1;&#x5B9A;<code>removeEventListener</code>&#x6765;&#x5B9E;&#x73B0;&#x79FB;&#x9664;&#x7ED1;&#x5B9A;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x95EE;&#x9898;&#x6709;&#xFF1A;
 1&#xFF0C;&#x5F53;&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x4E8B;&#x4EF6;&#x6C60;&#x4E2D;&#x628A;&#x6240;&#x6709;&#x7ED1;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x4F9D;&#x6B21;&#x7684;&#x6267;&#x884C;&#x3002;&#x6B64;&#x65F6;&#x4E0D;&#x7BA1;&#x54EA;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;this&#x90FD;&#x662F;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x3002;
                2&#xFF0C;&#x6211;&#x4EEC;&#x6309;&#x7167;&#x7ED1;&#x5B9A;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#xFF0C;&#x5206;&#x522B;&#x628A;&#x7ED1;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x589E;&#x52A0;&#x5230;&#x4E86;&#x5185;&#x7F6E;&#x7684;&#x4E8B;&#x4EF6;&#x6C60;&#x4E2D;&#xFF0C;&#x540E;&#x9762;&#x7ED1;&#x5B9A;&#x7684;&#x5728;&#x4E8B;&#x4EF6;&#x6C60;&#x7684;&#x6700;&#x540E;&#x9762;&#x3002;
                3&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x7684;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5DF2;&#x7ECF;&#x7ED9;&#x5143;&#x7D20;&#x7684;&#x8FD9;&#x4E2A;&#x884C;&#x4E3A;&#x7ED1;&#x5B9A;&#x8FC7;&#x4E00;&#x6B21;&#x4E86;&#xFF0C;&#x5728;&#x7ED1;&#x5B9A;&#x4E5F;&#x4E0D;&#x4F1A;&#x518D;&#x5F80;&#x4E8B;&#x4EF6;&#x6C60;&#x4E2D;&#x91CD;&#x590D;&#x589E;&#x52A0;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5BFC;&#x81F4;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x7ED9;&#x67D0;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x67D0;&#x4E2A;&#x884C;&#x4E3A; &#x7ED1;&#x5B9A;&#x591A;&#x4E2A;&#x201D;&#x4E0D;&#x91CD;&#x590D;&#x7684;&#x65B9;&#x6CD5;&#x201C;&#xFF1B;
               4,  &#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4E00;&#x822C;&#x5199;<strong>false</strong>&#xFF0C;&#x8BA9;&#x7ED1;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x5728;&#x4E8B;&#x4EF6;&#x7684;<strong>&#x5192;&#x6CE1;&#x4F20;&#x64AD;</strong>&#x9636;&#x6BB5;&#x6267;&#x884C;&#x3002;true&#x8BA9;&#x65B9;&#x6CD5;&#x5728;&#x4E8B;&#x4EF6;&#x4F20;&#x64AD;&#x7684;&#x6355;&#x83B7;&#x9636;&#x6BB5;&#x6267;&#x884C;&#x3002;
               5, removeEventListener&#xFF0C;&#x79FB;&#x9664;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x4E00;&#x4E2A;&#x4E0D;&#x80FD;&#x5C11;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x548C;&#x7ED1;&#x5B9A;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x624D;&#x53EF;&#x4EE5;&#x79FB;&#x9664;&#x3002;DOM0&#x4E8B;&#x4EF6;&#x7684;&#x79FB;&#x9664;&#x7528;null&#x5373;&#x53EF;&#xFF0C;DOM2&#x7684;&#x533F;&#x540D;&#x51FD;&#x6570;&#x65E0;&#x6CD5;&#x79FB;&#x9664;&#xFF0C;&#x6240;&#x4EE5;DOM 2&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x4E00;&#x822C;&#x7528;&#x5B9E;&#x540D;&#x51FD;&#x6570;&#xFF0C;&#x65B9;&#x4FBF;&#x79FB;&#x9664;&#x3002;
               6&#xFF0C;DOM   0&#x548C;2&#x662F;&#x53EF;&#x4EE5;&#x5171;&#x5B58;&#x7684;&#x3002;&#x539F;&#x7406;&#x4E0D;&#x540C;&#x3002;</p>
<pre><code>
&#x5728;&#x5F15;&#x5165;jQ&#x4E4B;&#x540E;&#xFF0C;$(document).ready(function(){}) &#x7B80;&#x5199; $(function(){} )&#xFF0C;&#x5B83;&#x91C7;&#x7528;&#x7684;&#x662F;DOM&#x4E8C;&#x7EA7;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x3002;&#x5E76;&#x4E14;&#x91C7;&#x7528;&#x7684;&#x662F;DOM&#x4E8C;&#x7EA7;&#x4E2D;&#x72EC;&#x6709;&#x7684;&#x4E8B;&#x4EF6;&#x8FDB;&#x884C;&#x7ED1;&#x5B9A;&#x7684;:DOMContentLoaded(HTML&#x7ED3;&#x6784;&#x52A0;&#x8F7D;&#x5B8C;&#x6210;)
&#x5F53;&#x524D;&#x9875;&#x9762;&#x7684;HTML&#x7ED3;&#x6784;&#x52A0;&#x8F7D;&#x5B8C;&#x6210;&#x5C31;&#x4F1A;&#x89E6;&#x53D1;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x4E2D;&#x4F7F;&#x7528;&#x591A;&#x6B21;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x90FD;&#x662F;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x7684;&#x3002;
</code></pre><p>##IE&#x4E0B;&#x7684;DOM 2&#x7EA7;&#x4E8B;&#x4EF6;&#x53CA;&#x5176;&#x517C;&#x5BB9;&#x95EE;&#x9898;
1&#xFF09;&#x7ED1;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x4EE5;&#x53CA;&#x8BED;&#x6CD5;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x3002; document.body.attachEvent(&quot;onclick&quot;,fn1 )    &#x53C2;&#x6570;&#x53EA;&#x80FD;&#x4E24;&#x4E2A;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x8981;&#x52A0;on&#xFF0C;&#x9ED8;&#x8BA4;&#x53EA;&#x80FD;&#x5728;&#x5192;&#x6CE1;&#x9636;&#x6BB5;&#x53D1;&#x751F;&#xFF0C;&#x4E0D;&#x80FD;&#x63A7;&#x5236;&#x5728;&#x6355;&#x83B7;&#x9636;&#x6BB5;&#x3002;
        2&#xFF09;&apos;this&apos;&#x95EE;&#x9898;&#xFF1A;&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#xFF0C;&#x6267;&#x884C;&#x5BF9;&#x5E94;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6807;&#x51C6;&#x6D4F;&#x89C8;&#x5668;&#x4E0B;&#xFF0C;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;this &#x662F;&#x5F53;&#x524D;&#x7684;&#x5143;&#x7D20;&#xFF0C;IE6-8&#x4E0B;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;this&#x662F;window&#x3002;
        3&#xFF09;&#x6807;&#x51C6;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x67D0;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#x4E0D;&#x80FD;&#x91CD;&#x590D;&#xFF0C;&#x5982;&#x679C;&#x7ED1;&#x5B9A;&#x8FC7;&#x4E0D;&#x518D;&#x91CD;&#x590D;&#x7684;&#x7ED1;&#x5B9A;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x540E;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x53EA;&#x6267;&#x884C;&#x4E00;&#x6B21;&#xFF0C;&#x4F46;&#x662F;IE6-8&#x4E0B;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x53BB;&#x91CD;&#xFF0C;&#x54EA;&#x6015;&#x65B9;&#x6CD5;&#x91CD;&#x590D;&#x4E86;&#xFF0C;&#x4E5F;&#x90FD;&#x4F1A;&#x7ED9;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x7ED1;&#x5B9A;&#x4E0A;&#xFF0C;&#x5F53;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ED1;&#x5B9A;&#x51E0;&#x6B21;&#x5C31;&#x91CD;&#x590D;&#x6267;&#x884C;&#x51E0;&#x6B21;&#x3002;
        4&#xFF09;&#x987A;&#x5E8F;&#x95EE;&#x9898;&#xFF1A;&#x6807;&#x51C6;&#x6D4F;&#x89C8;&#x5668;&#x4E0B;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x7684;&#x987A;&#x5E8F;&#x662F;&#x6309;&#x7167;&#x7ED1;&#x5B9A;&#x7684;&#x987A;&#x5E8F;&#x4F9D;&#x6B21;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x662F;ie6-8&#x4E0B;&#x6267;&#x884C;&#x7684;&#x987A;&#x5E8F;&#x548C;&#x7ED1;&#x5B9A;&#x7684;&#x987A;&#x5E8F;&#x65E0;&#x5173;&#xFF0C;&#x662F;&#x6DF7;&#x4E71;&#x7684;&#x3002;</p>
<p>##&#x4E8B;&#x4EF6;&#x4F20;&#x64AD;&#xFF08;&#x5192;&#x6CE1;&#x548C;&#x6355;&#x83B7;&#xFF09;</p>
<blockquote>
<p>&#x4E8B;&#x4EF6;&#x7684;&#x5192;&#x6CE1;&#x4F20;&#x64AD;&#xFF1A;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x884C;&#x4E3A;&#x88AB;&#x89E6;&#x53D1;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x6240;&#x6709;<strong>&#x7236;&#x7EA7;&#x5143;&#x7D20;</strong>&#x7684;&#x76F8;&#x5173;&#x884C;&#x4E3A;&#x90FD;&#x4F1A;&#x88AB;&#x89E6;&#x53D1;&#xFF0C;&#x8FD9;&#x79CD;&#x4E8B;&#x4EF6;&#x7684;&#x4F20;&#x64AD;&#x673A;&#x5236;&#x53EB;&#x505A;&quot;&#x5192;&#x6CE1;&#x4F20;&#x64AD;&quot;&#xFF1B;</p>
</blockquote>
<ul>
<li>&#x5192;&#x6CE1;&#x4F20;&#x64AD;&#x548C;&#x4E8B;&#x4EF6;&#x662F;&#x5426;&#x88AB;&#x7ED1;&#x5B9A;&#x65E0;&#x5173;&#xFF0C;</li>
<li>mouseenter &#x548C;mouseover&#x7684;&#x533A;&#x522B;&#xFF1A;
1&#xFF0C;mouseenter&#x9ED8;&#x8BA4;&#x963B;&#x6B62;&#x4E86;&#x4E8B;&#x4EF6;&#x7684;&#x5192;&#x6CE1;&#x4F20;&#x64AD;&#xFF0C;&#x5B50;&#x5143;&#x7D20;&#x7684;mouseenter&#x4E8B;&#x4EF6;&#x88AB;&#x89E6;&#x53D1;&#xFF0C;&#x7236;&#x7EA7;&#x7684;&#x76F8;&#x5173;&#x4E8B;&#x4EF6;&#x4E0D;&#x4F1A;&#x80CC;&#x89E6;&#x53D1;&#x3002;&#x4F46;&#x662F;mouseover&#x5B58;&#x5728;&#x5192;&#x6CE1;&#x4F20;&#x64AD;&#xFF0C;
2&#xFF0C;&#x5F53;&#x9F20;&#x6807;&#x5148;&#x4ECE;&#x7236;&#x5230;&#x5B50;&#xFF0C;&#x518D;&#x4ECE;&#x5B50;&#x5230;&#x7236;&#xFF0C;&#x4F1A;&#x91CD;&#x65B0;&#x89E6;&#x53D1;&#x7EFF;&#x76D2;&#x5B50;&#x7684;mouseover&#x4F46;&#x662F;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#x7EFF;&#x76D2;&#x5B50;&#x7684;onmouseenter&#xFF0C;</li>
</ul>
<blockquote>
<p><strong>&#x4E8B;&#x4EF6;&#x59D4;&#x6258;</strong>&#xFF1A;&#x5229;&#x7528;&#x4E86;&#x5192;&#x6CE1;&#x673A;&#x5236;&#xFF0C;&#x5F53;&#x5BB9;&#x5668;&#x4E2D;&#x67D0;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x7684;&#x76F8;&#x5173;&#x884C;&#x4E3A;&#x89E6;&#x53D1;&#xFF0C;&#x5F53;&#x524D;&#x5BB9;&#x5668;&#x7684;&#x76F8;&#x5173;&#x884C;&#x4E3A;&#x4E5F;&#x4F1A;&#x88AB;&#x89E6;&#x53D1;&#xFF0C;&#x5982;&#x679C;&#x7ED9;&#x5BB9;&#x5668;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x4E86;&#x65B9;&#x6CD5;&#xFF0C;&#x65B9;&#x6CD5;&#x4E5F;&#x4F1A;&#x88AB;&#x6267;&#x884C;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5230;&#x4E8B;&#x4EF6;&#x6E90;&#xFF08;&#x5F53;&#x524D;&#x64CD;&#x4F5C;&#x7684;&#x5143;&#x7D20;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E8B;&#x4EF6;&#x6E90;&#x662F;&#x8C01;&#x6765;&#x505A;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;</p>
</blockquote>


        </div>
    
</div>
<style>
    .page-toc{
        overflow: hidden;
        position:fixed;
        left:50%;
        margin-left:250px;
	width:350px
    }
    .page-toc > ul li{
        list-style-position: inside;
	line-height:120%
    }
    .page-toc > ul{
        transition: all 0.2s;
        position: relative;
    }
    .page-toc > ul a {
	color:#009a61;
	font-size:110% ! important;
	line-height:120%
    }
    .page-toc > ul .red{
        background: #f3f3f3;
        z-index: 1;
        border-left: 3px solid #009a61;
        -webkit-transition: all .2s ease;
        transition: all .2s ease;
	color:#000
    }

    .markdown-body{
	font-size: 120% ! important;
        max-width:800px;
    }
    .container{
       font-size: 110% ! important;
    }
    html,body,.container{
      font-family: Helvetica Neue,Helvetica,Arial,PingFang SC,Hiragino Sans GB,WenQuanYi Micro Hei,Microsoft Yahei,sans-serif ! important;
    }
    /*url("/static/img/banner.jpg") no-repeat*/
    .bs-docs-header{
        background:linear-gradient(to right ,#333333 50%,#0d0b0c 50%) ;
        padding: 0;
    }
    .new-back{
        background-image: url("static/img/banner.jpg") ;
        background-repeat: no-repeat;
        background-position: center center;
        padding: 88px;
    }
    .markdown-body pre code,.markdown-body code{
        font-size: 20px;
        line-height: 24px;
    }
    .markdown-body code{
      line-height: inherit;
    }
    .markdown-body h3{
        font-size:1.4em;
    }
    .markdown-body h4{
        font-size:1em;
    }



    /*index*/
    .jw-style{
        font-size: 1.75em;
        color: #1d3e81;
        line-height: 2em;
    }

    .understand-me {
        text-align: center;
        margin: 100px auto 0;
    }

    .understand-me li {
        vertical-align: top;
        width: 33.3333%;
        display: inline-block;
        *display: inline;
        *zoom: 1;
        text-align: center;
    }

    .understand-me li span {
        color: #1a1a1a;
        font-size: 1.6em;

    }

    .understand-me p {
        margin: 0 auto;
        width: 90%;
        text-align: left;
        color: #4c4c4c;
        font-size: 1em;
        line-height: 1.2em;
    }

    .understand-me img {
        -webkit-transition: all 0.4s;
        -moz-transition: all 0.4s;
        -ms-transition: all 0.4s;
        -o-transition: all 0.4s;
        transition: all 0.4s;
    }
    .footers{
        background:#0a0a0a url('static/img/footer.jpg') no-repeat center center;height: 248px; margin-top: 40px
    }
    .understand-me img:hover {
        -webkit-transform: rotate(-90deg);
        -moz-transform: rotate(-90deg);
        -ms-transform: rotate(-90deg);
        -o-transform: rotate(-90deg);
        transform: rotate(-90deg);
    }
    @media screen and (max-width: 479px) {
        .understand-me li{
            width: 100%;
            margin-bottom: 2em;
        }
        .new-back{
            padding: 28px;
        }
        .understand-me p {
            width: 60%;
        }
        .footers{
            height: 80px;
            background-size:auto 100%;;
        }
    }

</style>
<script src="https://cdn.bootcss.com/jquery/3.0.0/jquery.js"></script>
<script>
if(!$('.understand-me').length){
var bar = $(window).height() - $('.navbar ').height() - $('.page-toc').position().top;
var count =  bar/26/2;
var barHeight = $('.page-toc').outerHeight();
$('.page-toc li').eq(0).children('a').addClass('red');
var arr = [];
$("h1,h2,h3,h4,h5,h6").each(function () {
    arr.push($(this).position().top);
});
if(!($(window).height()-50 > barHeight)){
    var flagTop = true;
}
function dark(){
    var top =  Math.abs($('.page-toc > ul').position().top);
    var cur = $(document).scrollTop();
    for(var i = arr.length; i >=0;i--){
        if(arr[i]<=cur){
            break;
        }
    }
    if(i===-1){
        i = 0;
    }
    $('.page-toc li a').removeClass('red');
    $('.page-toc li').eq(i).children('a').addClass('red');
    if(flagTop){
      if(i> arr.length-count){
          $(' .page-toc > ul').css('top',-(barHeight-bar));
          return;
      }
      if(i>count){
          $(' .page-toc > ul').css('top',-26*(i-count));
      }else{
          $(' .page-toc > ul').css('top',0);
      }
    }
}
$(window).on('scroll',dark);
}
</script>

</body>
</html>


<script>

</script>